# Найдите сумму цифр трехзначного числа n.
# Результат сохраните в перменную res.

# Решение через число
n = int(input())

n3 = n % 10
n2 = (n // 10) % 10
n1 = n // 100

res = n1+n2+n3
print(res)

# Решение через строку
n = input()

n1 = int(n[0])
n2 = int(n[1])
n3 = int(n[2])

res = n1+n2+n3
print(res)
