"""
Задача №21.
Напишите программу для печати всех уникальных значений в словаре.
Input:  [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"},
        {"VII": "S005"}, {" V ":"S009"}, {" VIII":"S007"}]
Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
"""

dict = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"},
        {"VII": " S005 "}, {" V ": " S009 "}, {" VIII ": " S007 "}]
result = set()  # создаем пустое множество
for i in dict:
    for j, y in i.items():
        # print(y)
        result.add(y)   # добавляем уникальные значения, т.к. это множество
print(result)
